Tekla Open API Reference for Tekla Structures 2025
Settings.TryGetValue Method
Overload List
Name | Description
TryGetValue(String, Object)
 Tries to get the value of the setting with the given name.
TryGetValue<T>(String, T)
 Tries to get the value of the setting with the given name and given object type.
Top
See Also
Reference
Settings Class
Tekla.Structures.Datatype Namespace